[0m[1mdata.aws_ami.linux2_ami: Reading...[0m[0m
[0m[1maws_vpc.vpc: Refreshing state... [id=vpc-0eb1fe89dc0576ef9][0m
[0m[1maws_subnet.db[1]: Refreshing state... [id=subnet-05ee11be15a53ff17][0m
[0m[1maws_subnet.db[0]: Refreshing state... [id=subnet-0c1ee98f5bbcfcaa9][0m
[0m[1maws_internet_gateway.igw: Refreshing state... [id=igw-02c1191b6fb0ec61f][0m
[0m[1maws_security_group.web_sg: Refreshing state... [id=sg-0ab4a43e9d264572f][0m
[0m[1maws_subnet.private[0]: Refreshing state... [id=subnet-03acb4036889acd9d][0m
[0m[1maws_db_subnet_group.rds_subnet_group: Refreshing state... [id=rds-subnet-group][0m
[0m[1maws_route_table.public_rt: Refreshing state... [id=rtb-0be617f7d29c898fa][0m
[0m[1maws_subnet.public[0]: Refreshing state... [id=subnet-0834e3471167e619c][0m
[0m[1maws_security_group.db_sg: Refreshing state... [id=sg-04c5a2138480b2548][0m
[0m[1maws_route_table_association.public_rt_association[0]: Refreshing state... [id=rtbassoc-0d77ddfa5ef11be5f][0m
[0m[1maws_db_instance.rds: Refreshing state... [id=terraform-20220713164410976800000001][0m
[0m[1mdata.aws_ami.linux2_ami: Read complete after 3s [id=ami-0bba0a4cb75835f71][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
  [33m~[0m update in-place
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # aws_instance.web_server[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_instance" "web_server" {
      [32m+[0m [0m[1m[0mami[0m[0m                                  = "ami-0bba0a4cb75835f71"
      [32m+[0m [0m[1m[0marn[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0massociate_public_ip_address[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcpu_core_count[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mcpu_threads_per_core[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mdisable_api_stop[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mdisable_api_termination[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mebs_optimized[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mget_password_data[0m[0m                    = false
      [32m+[0m [0m[1m[0mhost_id[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                   = (known after apply)
      [32m+[0m [0m[1m[0minstance_initiated_shutdown_behavior[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0minstance_state[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0minstance_type[0m[0m                        = "t2.micro"
      [32m+[0m [0m[1m[0mipv6_address_count[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mipv6_addresses[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mkey_name[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mmonitoring[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0moutpost_arn[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mpassword_data[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mplacement_group[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mplacement_partition_number[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mprimary_network_interface_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_dns[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0msecondary_private_ips[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msecurity_groups[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0msource_dest_check[0m[0m                    = true
      [32m+[0m [0m[1m[0msubnet_id[0m[0m                            = "subnet-03acb4036889acd9d"
      [32m+[0m [0m[1m[0mtags[0m[0m                                 = {
          [32m+[0m [0m"App"         = "wordpress"
          [32m+[0m [0m"Name"        = "wordpress-server-0"
          [32m+[0m [0m"Owner"       = "dimitartachev"
          [32m+[0m [0m"Provisioner" = "terraform"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                             = {
          [32m+[0m [0m"App"         = "wordpress"
          [32m+[0m [0m"Name"        = "wordpress-server-0"
          [32m+[0m [0m"Owner"       = "dimitartachev"
          [32m+[0m [0m"Provisioner" = "terraform"
        }
      [32m+[0m [0m[1m[0mtenancy[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0muser_data[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0muser_data_base64[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0muser_data_replace_on_change[0m[0m          = false
      [32m+[0m [0m[1m[0mvpc_security_group_ids[0m[0m               = [
          [32m+[0m [0m"sg-0ab4a43e9d264572f",
        ]

      [32m+[0m [0mcapacity_reservation_specification {
          [32m+[0m [0m[1m[0mcapacity_reservation_preference[0m[0m = (known after apply)

          [32m+[0m [0mcapacity_reservation_target {
              [32m+[0m [0m[1m[0mcapacity_reservation_id[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mcapacity_reservation_resource_group_arn[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mebs_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0msnapshot_id[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }

      [32m+[0m [0menclave_options {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mephemeral_block_device {
          [32m+[0m [0m[1m[0mdevice_name[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mno_device[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_name[0m[0m = (known after apply)
        }

      [32m+[0m [0mmaintenance_options {
          [32m+[0m [0m[1m[0mauto_recovery[0m[0m = (known after apply)
        }

      [32m+[0m [0mmetadata_options {
          [32m+[0m [0m[1m[0mhttp_endpoint[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mhttp_tokens[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0minstance_metadata_tags[0m[0m      = (known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_index[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_card_index[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m  = (known after apply)
        }

      [32m+[0m [0mprivate_dns_name_options {
          [32m+[0m [0m[1m[0menable_resource_name_dns_a_record[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mhostname_type[0m[0m                        = (known after apply)
        }

      [32m+[0m [0mroot_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = true
          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = 30
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }
    }

[1m  # aws_instance.web_server[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_instance" "web_server" {
      [32m+[0m [0m[1m[0mami[0m[0m                                  = "ami-0bba0a4cb75835f71"
      [32m+[0m [0m[1m[0marn[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0massociate_public_ip_address[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcpu_core_count[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mcpu_threads_per_core[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mdisable_api_stop[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mdisable_api_termination[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mebs_optimized[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mget_password_data[0m[0m                    = false
      [32m+[0m [0m[1m[0mhost_id[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                   = (known after apply)
      [32m+[0m [0m[1m[0minstance_initiated_shutdown_behavior[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0minstance_state[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0minstance_type[0m[0m                        = "t2.micro"
      [32m+[0m [0m[1m[0mipv6_address_count[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mipv6_addresses[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mkey_name[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mmonitoring[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0moutpost_arn[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mpassword_data[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mplacement_group[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mplacement_partition_number[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mprimary_network_interface_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_dns[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0msecondary_private_ips[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msecurity_groups[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0msource_dest_check[0m[0m                    = true
      [32m+[0m [0m[1m[0msubnet_id[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                                 = {
          [32m+[0m [0m"App"         = "wordpress"
          [32m+[0m [0m"Name"        = "wordpress-server-1"
          [32m+[0m [0m"Owner"       = "dimitartachev"
          [32m+[0m [0m"Provisioner" = "terraform"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                             = {
          [32m+[0m [0m"App"         = "wordpress"
          [32m+[0m [0m"Name"        = "wordpress-server-1"
          [32m+[0m [0m"Owner"       = "dimitartachev"
          [32m+[0m [0m"Provisioner" = "terraform"
        }
      [32m+[0m [0m[1m[0mtenancy[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0muser_data[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0muser_data_base64[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0muser_data_replace_on_change[0m[0m          = false
      [32m+[0m [0m[1m[0mvpc_security_group_ids[0m[0m               = [
          [32m+[0m [0m"sg-0ab4a43e9d264572f",
        ]

      [32m+[0m [0mcapacity_reservation_specification {
          [32m+[0m [0m[1m[0mcapacity_reservation_preference[0m[0m = (known after apply)

          [32m+[0m [0mcapacity_reservation_target {
              [32m+[0m [0m[1m[0mcapacity_reservation_id[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mcapacity_reservation_resource_group_arn[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mebs_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0msnapshot_id[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }

      [32m+[0m [0menclave_options {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mephemeral_block_device {
          [32m+[0m [0m[1m[0mdevice_name[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mno_device[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_name[0m[0m = (known after apply)
        }

      [32m+[0m [0mmaintenance_options {
          [32m+[0m [0m[1m[0mauto_recovery[0m[0m = (known after apply)
        }

      [32m+[0m [0mmetadata_options {
          [32m+[0m [0m[1m[0mhttp_endpoint[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mhttp_tokens[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0minstance_metadata_tags[0m[0m      = (known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_index[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_card_index[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m  = (known after apply)
        }

      [32m+[0m [0mprivate_dns_name_options {
          [32m+[0m [0m[1m[0menable_resource_name_dns_a_record[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mhostname_type[0m[0m                        = (known after apply)
        }

      [32m+[0m [0mroot_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = true
          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = 30
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }
    }

[1m  # aws_route_table_association.public_rt_association[0][0m must be [1m[31mreplaced[0m[0m
[0m  # [0m(moved from aws_route_table_association.public_rt_association)
[0m[31m-[0m/[32m+[0m[0m resource "aws_route_table_association" "public_rt_association" {
      [33m~[0m [0m[1m[0mid[0m[0m             = "rtbassoc-0d77ddfa5ef11be5f" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msubnet_id[0m[0m      = "subnet-0834e3471167e619c" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # aws_route_table_association.public_rt_association[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "public_rt_association" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = "rtb-0be617f7d29c898fa"
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)
    }

[1m  # aws_subnet.private[0][0m will be updated in-place[0m[0m
[0m  # [0m(moved from aws_subnet.private)
[0m  [33m~[0m[0m resource "aws_subnet" "private" {
        [1m[0mid[0m[0m                                             = "subnet-03acb4036889acd9d"
      [33m~[0m [0m[1m[0mtags[0m[0m                                           = {
          [33m~[0m [0m"Name"        = "wordpress-private-subnet" [33m->[0m [0m"wordpress-private-subnet-0"
            [90m# (3 unchanged elements hidden)[0m[0m
        }
      [33m~[0m [0m[1m[0mtags_all[0m[0m                                       = {
          [33m~[0m [0m"Name"        = "wordpress-private-subnet" [33m->[0m [0m"wordpress-private-subnet-0"
            [90m# (3 unchanged elements hidden)[0m[0m
        }
        [90m# (14 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_subnet.private[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_subnet" "private" {
      [32m+[0m [0m[1m[0marn[0m[0m                                            = (known after apply)
      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m                = false
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                                     = "10.1.4.0/24"
      [32m+[0m [0m[1m[0menable_dns64[0m[0m                                   = false
      [32m+[0m [0m[1m[0menable_resource_name_dns_a_record_on_launch[0m[0m    = false
      [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record_on_launch[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mipv6_native[0m[0m                                    = false
      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m                        = false
      [32m+[0m [0m[1m[0mowner_id[0m[0m                                       = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns_hostname_type_on_launch[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                                           = {
          [32m+[0m [0m"App"         = "wordpress"
          [32m+[0m [0m"Name"        = "wordpress-private-subnet-1"
          [32m+[0m [0m"Owner"       = "dimitartachev"
          [32m+[0m [0m"Provisioner" = "terraform"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                                       = {
          [32m+[0m [0m"App"         = "wordpress"
          [32m+[0m [0m"Name"        = "wordpress-private-subnet-1"
          [32m+[0m [0m"Owner"       = "dimitartachev"
          [32m+[0m [0m"Provisioner" = "terraform"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                                         = "vpc-0eb1fe89dc0576ef9"
    }

[1m  # aws_subnet.public[0][0m must be [1m[31mreplaced[0m[0m
[0m  # [0m(moved from aws_subnet.public)
[0m[31m-[0m/[32m+[0m[0m resource "aws_subnet" "public" {
      [33m~[0m [0m[1m[0marn[0m[0m                                            = "arn:aws:ec2:eu-west-1:825144470306:subnet/subnet-0834e3471167e619c" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mavailability_zone[0m[0m                              = "eu-west-1a" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mavailability_zone_id[0m[0m                           = "euw1-az3" [33m->[0m [0m"euw1-az2" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m                                             = "subnet-0834e3471167e619c" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m                 = (known after apply)
      [31m-[0m [0m[1m[0mmap_customer_owned_ip_on_launch[0m[0m                = false [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m                        = false [33m->[0m [0mtrue
      [33m~[0m [0m[1m[0mowner_id[0m[0m                                       = "825144470306" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_dns_hostname_type_on_launch[0m[0m            = "ip-name" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mtags[0m[0m                                           = {
          [33m~[0m [0m"Name"        = "wordpress-public-subnet" [33m->[0m [0m"wordpress-public-subnet-0"
            [90m# (3 unchanged elements hidden)[0m[0m
        }
      [33m~[0m [0m[1m[0mtags_all[0m[0m                                       = {
          [33m~[0m [0m"Name"        = "wordpress-public-subnet" [33m->[0m [0m"wordpress-public-subnet-0"
            [90m# (3 unchanged elements hidden)[0m[0m
        }
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_subnet.public[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m [0m[1m[0marn[0m[0m                                            = (known after apply)
      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m                = false
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                                     = "10.1.112.0/24"
      [32m+[0m [0m[1m[0menable_dns64[0m[0m                                   = false
      [32m+[0m [0m[1m[0menable_resource_name_dns_a_record_on_launch[0m[0m    = false
      [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record_on_launch[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mipv6_native[0m[0m                                    = false
      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m                        = true
      [32m+[0m [0m[1m[0mowner_id[0m[0m                                       = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns_hostname_type_on_launch[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                                           = {
          [32m+[0m [0m"App"         = "wordpress"
          [32m+[0m [0m"Name"        = "wordpress-public-subnet-1"
          [32m+[0m [0m"Owner"       = "dimitartachev"
          [32m+[0m [0m"Provisioner" = "terraform"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                                       = {
          [32m+[0m [0m"App"         = "wordpress"
          [32m+[0m [0m"Name"        = "wordpress-public-subnet-1"
          [32m+[0m [0m"Owner"       = "dimitartachev"
          [32m+[0m [0m"Provisioner" = "terraform"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                                         = "vpc-0eb1fe89dc0576ef9"
    }

[0m[1mPlan:[0m 7 to add, 1 to change, 2 to destroy.
[0m[0m[1maws_route_table_association.public_rt_association[0]: Destroying... [id=rtbassoc-0d77ddfa5ef11be5f][0m[0m
[0m[1maws_route_table_association.public_rt_association[0]: Destruction complete after 0s[0m
[0m[1maws_subnet.public[0]: Destroying... [id=subnet-0834e3471167e619c][0m[0m
[0m[1maws_subnet.public[0]: Destruction complete after 1s[0m
[0m[1maws_subnet.private[1]: Creating...[0m[0m
[0m[1maws_subnet.private[0]: Modifying... [id=subnet-03acb4036889acd9d][0m[0m
[0m[1maws_subnet.private[0]: Modifications complete after 1s [id=subnet-03acb4036889acd9d][0m
[0m[1maws_subnet.private[1]: Creation complete after 1s [id=subnet-0cdc1c8ae5a14fb34][0m
[0m[1maws_subnet.public[0]: Creating...[0m[0m
[0m[1maws_subnet.public[1]: Creating...[0m[0m
[0m[1maws_instance.web_server[0]: Creating...[0m[0m
[0m[1maws_instance.web_server[1]: Creating...[0m[0m
[0m[1maws_subnet.public[0]: Still creating... [10s elapsed][0m[0m
[0m[1maws_instance.web_server[0]: Still creating... [10s elapsed][0m[0m
[0m[1maws_subnet.public[1]: Still creating... [10s elapsed][0m[0m
[0m[1maws_instance.web_server[1]: Still creating... [10s elapsed][0m[0m
[0m[1maws_subnet.public[1]: Creation complete after 11s [id=subnet-0a714014aa2076788][0m
[0m[1maws_subnet.public[0]: Creation complete after 11s [id=subnet-0fa2ffbbb4819f8cd][0m
[0m[1maws_route_table_association.public_rt_association[0]: Creating...[0m[0m
[0m[1maws_route_table_association.public_rt_association[1]: Creating...[0m[0m
[0m[1maws_route_table_association.public_rt_association[0]: Creation complete after 0s [id=rtbassoc-074dababd672a93c9][0m
[0m[1maws_route_table_association.public_rt_association[1]: Creation complete after 0s [id=rtbassoc-089966cfe74865f08][0m
[0m[1maws_instance.web_server[0]: Still creating... [20s elapsed][0m[0m
[0m[1maws_instance.web_server[1]: Still creating... [20s elapsed][0m[0m
[0m[1maws_instance.web_server[0]: Still creating... [30s elapsed][0m[0m
[0m[1maws_instance.web_server[1]: Still creating... [30s elapsed][0m[0m
[0m[1maws_instance.web_server[0]: Creation complete after 32s [id=i-052837441a1ba8e68][0m
[0m[1maws_instance.web_server[1]: Creation complete after 32s [id=i-03aa95bd06f5f587e][0m
[0m[1m[32m
Apply complete! Resources: 7 added, 1 changed, 2 destroyed.
[0m